package 蓝桥杯.lan真题训练.lqb2021省赛1场java;

public class C直线 {

    /***
     40257
     根据两点确定直线，得到直线的方程x − x 1 x 1 − x 2 = y − y 1 y 1 − y 2 \frac{x - x_1}{x_1 - x_2} = \frac{y - y_1}{y_1 - y_2}
     x
     1
     −x
     2
     x−x
     1
     =
     y
     1
     −y
     2
     y−y
     1
     ，然后将两点式方程化成一般式a x + b y + c = 0 ax + by + c = 0ax+by+c=0，求出所有的三元组{ a , b , c } \{a, b, c\}{a,b,c}然后去重即可。注意对于{ 1 , 2 , 1 } \{1,2,1\}{1,2,1}和{ 2 , 4 , 2 } \{2,4,2\}{2,4,2}是本质相同的直线，因此要对所有的这样三元组化为最简的，即除以三个数的g c d gcdgcd。
     PS：
     0和任何非0数求最大公因数都是那个数本身，比赛时还纠结了一下0，且求g c d gcdgcd时要取绝对值。
     如果使用点斜式，k kk的精度会带来误差。
     */

}
